/*Напишите цикл, который принимает на вход два числа 
(A и B) и возводит число A в натуральную степень B.
3, 5 -> 243 (3⁵)
2, 4 -> 16*/

Console.WriteLine("Введите число");
int num = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите степень");
int deg = Convert.ToInt32(Console.ReadLine());

for (int i = 1; i <= 1; i++)
   Console.WriteLine($"Результат возведения в степень {(long)Math.Pow(num, deg)}");








